artillery-v2/create-bids.yml
config:
  # target: "TYPE HERE THE DEPLOYED TARGET"
  target: "http://localhost:8080/scc2223-proj1-1.0/rest"
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true # new mode to aggregate metrics in artillery
  processor: "./test-utils.js"
  phases:
    - name: "Create bids" # Create bids
      duration: 1
      arrivalCount: 1

scenarios:
  - name: "Create bids"
    weight: 1
    flow:
      - loop:
          - function: "selectAuctionAndUserToBid" # Select auction and user to bid
          - post:
              url: "/user/auth"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                nickname: "{{ userNickname }}"
                pwd: "{{ userPwd }}"
              capture:
                header: "set-cookie"
                as: "cookie"
            # log the cookie
          - log: "this is the cookie: {{ cookie[0] }}"
          - post:
              url: "/auction/{{auctionId}}/bid"
              headers:
                Content-Type: application/json
                Accept: application/json
                Cookie: "{{ cookie[0] }}"
              json:
                userNickname: "{{ userNickname }}"
                value: "{{ value }}"
        count: 5 # number of bids to create