artillery-v2/workload0.yml
config:
  target: "http://20.101.0.189/scc2223-proj1-1.0/rest"
  http:
    timeout: 30
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true # new mode to aggregate metrics in artillery
  processor: "./test-utils.js"
  variables:
    numUsers: 100
  phases:
    - name: "Create users"
      arrivalRate: 1
      duration: 1

scenarios:
  - name: "Create users"
    weight: 1
    flow:
      - loop:
          - post: # First post image for the user
              url: "/media"
              headers:
                Content-Type: application/octet-stream
                Accept: application/json
              beforeRequest: "uploadImageBody"
              capture:
                regexp: "(.+)"
                as: "imageId" # capture the reply as image id to be used in user creation
              afterResponse: "processUploadImageReply"
          - function: "genNewUser" # Generate the needed information for the user
          - post:
              url: "/user"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                nickname: "{{ nickname }}"
                name: "{{ name }}"
                pwd: "{{ pwd }}"
                photoId: "{{ imageId }}"
              afterResponse: "processNewUserReply" # capture result and store in file
        count: "{{ numUsers }}"